farmertan81/Spot-Welder/STM32G474CE/src/main.c
static GPIO_PinState pedal_last_raw = GPIO_PIN_SET;
static GPIO_PinState pedal_stable = GPIO_PIN_SET;
static uint32_t pedal_last_change_ms = 0;

static float temp_filtered_c = 25.0f;
static float current_peak_amps = 0.0f;  // Track peak of recipe

/* Added calibration capture values */
static float cal_vcap_before = 0.0f;
static float cal_vcap_after = 0.0f;
static uint32_t cal_adc_peak_raw = 0;
static float cal_current_avg = 0.0f;

/* Configurable lead resistance (default 1.1 mΩ).
 * Measured: 0.54 mΩ + 0.57 mΩ = 1.1 mΩ total (4-wire Kelvin test).
 * 41% improvement over previous leads (1.87 mΩ → 1.1 mΩ). */
static float lead_resistance_ohms = 0.0011f;           // 1.1 mΩ measured
static const float LEAD_RESISTANCE_MIN_OHMS = 0.0001f; /* 0.1 mΩ */
static const float LEAD_RESISTANCE_MAX_OHMS = 0.0100f; /* 10.0 mΩ */

/* ============ Waveform Capture (Phase 3) ============ */
#define WAVEFORM_BUFFER_SIZE 50
#define WAVEFORM_LINE_BUFFER_SIZE 1200
#define WAVEFORM_SAMPLE_INTERVAL_US 100U

/* Safety check: each sample adds ~14 chars (",AAAA.AA,VV.VV") to WAVEFORM line.
 */
_Static_assert(WAVEFORM_BUFFER_SIZE <= 80,
               "WAVEFORM_BUFFER_SIZE too large for line buffer - increase "
               "WAVEFORM_LINE_BUFFER_SIZE");

typedef struct {
    float current_amps;
    float voltage_volts;
    uint32_t timestamp_us;
} WaveformSample;

static WaveformSample waveform_buffer[WAVEFORM_BUFFER_SIZE];
static volatile uint16_t waveform_index = 0;
static volatile bool waveform_capture_active = false;
static uint32_t waveform_capture_start_us = 0;
static uint32_t waveform_last_sample_us = 0;
/* Cached once before each pulse to avoid slow 16x averaged voltage reads during
 * 200us sampling. */
static float cached_vcap = 0.0f;

/* ============ Contact trigger state ============ */
static bool contact_hold_active = false;
static uint32_t contact_hold_start_ms = 0;
static bool contact_fire_lock = false;

/* ==== Voltage-based contact detection state (AMC1311B vcap) ==== */
static float g_contact_threshold_v = 1.5f;
static bool g_contact_state = false;
static bool g_contact_pending_high = false;
static uint32_t g_contact_pending_since_ms = 0;
static uint32_t g_contact_last_sample_ms = 0;
static float g_contact_last_vcap = 0.0f;

/* ============ INA226 state (CONTROL SYSTEM) ============ */
static volatile bool ina226_ok = false;
static float ina_vpack = 0.0f;
static float vlow = 0.0f;      /* TAP_LOW  (0x41) – bottom of stack */
static float vmid = 0.0f;      /* TAP_MID  (0x44) – middle tap      */
static float ina_cell1 = 0.0f; /* Bottom cell: vlow                  */
static float ina_cell2 = 0.0f; /* Middle cell: vmid - vlow           */
static float ina_cell3 = 0.0f; /* Top cell:    vpack - vmid          */
static float ina_ichg = 0.0f;

/* ============ Charger state ============ */
static bool charger_enabled = false;

/* 🔴 Charger lockout (post-weld) */
static bool charger_lockout = false;
static uint32_t charger_lockout_until = 0;

/* ============ UART RX Buffer ============ */
#define RX_LINE_MAX 128
static uint8_t rx_byte;
static char rx_build[RX_LINE_MAX];
static uint8_t rx_idx = 0;
static char rx_ready[RX_LINE_MAX];
static volatile bool rx_line_ready = false;

/* ============ UART debug ============ */
#define DEBUG_UART_RX 1
static volatile uint32_t uart_rx_bytes = 0;
static volatile uint32_t uart_rx_errors = 0;
static volatile uint32_t uart_rx_overruns = 0;

/* ============ INA226 Bare-Metal I2C Driver ============ */

static bool ina226_write_reg(uint8_t addr, uint8_t reg, uint16_t val) {
    uint8_t data[2];
    data[0] = (val >> 8) & 0xFF;
    data[1] = val & 0xFF;
    HAL_StatusTypeDef st = HAL_I2C_Mem_Write(&hi2c1, (uint16_t)(addr << 1), reg,
                                             I2C_MEMADD_SIZE_8BIT, data, 2, 10);
    return (st == HAL_OK);
}

static bool ina226_read_reg(uint8_t addr, uint8_t reg, uint16_t* val) {
    uint8_t data[2];
    HAL_StatusTypeDef st = HAL_I2C_Mem_Read(&hi2c1, (uint16_t)(addr << 1), reg,
                                            I2C_MEMADD_SIZE_8BIT, data, 2, 10);
    if (st != HAL_OK) return false;
    *val = ((uint16_t)data[0] << 8) | data[1];
    return true;
}

static bool ina226_read_bus_voltage(uint8_t addr, float* voltage) {
    uint16_t raw;
    if (!ina226_read_reg(addr, INA226_REG_BUS_V, &raw)) return false;
    *voltage = raw * 0.00125f; /* 1.25 mV/bit */
    return true;
}

static bool ina226_read_shunt_current(uint8_t addr, float* current) {
    uint16_t raw;
    if (!ina226_read_reg(addr, INA226_REG_SHUNT_V, &raw)) return false;
    int16_t signed_raw = (int16_t)raw;
    float shunt_voltage_v = signed_raw * 0.0000025f; /* 2.5 µV/bit */
    float calculated_current = shunt_voltage_v / INA226_SHUNT_R;
    *current = (-calculated_current) * CHARGE_CURRENT_CORRECTION;
    if (fabsf(*current) < 0.010f) *current = 0.0f;
    if (*current > 50.0f) *current = 50.0f;
    return true;
}

static bool ina226_health_check(void) {
    /* Verify all three sensors respond using HAL_I2C_IsDeviceReady (3 trials,
     * 10ms) */
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_PACK << 1), 3,
                              10) != HAL_OK)
        return false;
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_NODE1 << 1), 3,
                              10) != HAL_OK)
        return false;
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_NODE2 << 1), 3,
                              10) != HAL_OK)
        return false;
    return true;
}

static void ina226_read_all(void) {
    /* Step 1: Verify all three sensors are present on the bus */
    if (!ina226_health_check()) {
        ina226_ok = false;
        /* Safety: disable charger if any sensor missing */
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    float vp = 0, vl = 0, vm = 0, ichg = 0;
    bool ok = true;

    if (!ina226_read_bus_voltage(INA226_ADDR_PACK, &vp)) ok = false;
    if (!ina226_read_bus_voltage(INA226_ADDR_NODE1, &vl)) ok = false;
    if (!ina226_read_bus_voltage(INA226_ADDR_NODE2, &vm)) ok = false;
    if (!ina226_read_shunt_current(INA226_ADDR_PACK, &ichg)) ok = false;

    ina226_ok = ok;

    if (!ok) {
        /* Safety: disable charger on read failure */
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    ina_vpack = vp * VPACK_SCALE;
    vlow = vl * V_NODE1_SCALE;
    vmid = vm * V_NODE2_SCALE;

    /* Correct cell voltage math:
     * [Pack-] ── Cell_Bot ── (vlow/0x41) ── Cell_Mid ── (vmid/0x44) ── Cell_Top
     * ── [Pack+]
     */
    ina_cell1 = vlow;             /* Bottom cell */
    ina_cell2 = vmid - vlow;      /* Middle cell */
    ina_cell3 = ina_vpack - vmid; /* Top cell    */

    ina_ichg = ichg;
}

/* ============ Charger State Machine (INA226 ONLY) ============ */

static void chargerStateMachine(void) {
    uint32_t now = HAL_GetTick();

    /* 🔴 LOCKOUT: block charger after weld */
    if (charger_lockout) {
        if ((int32_t)(now - charger_lockout_until) >= 0) {
            charger_lockout = false;  // release lock
        } else {
            HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
            charger_enabled = false;
            return;
        }
    }

