farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* SAFETY: INA226 failure → charger OFF */
    if (!ina226_ok) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* DISARMED → charger OFF */
    if (!armed) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* WELDING → charger OFF */
    if (welding_now) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* NORMAL HYSTERESIS CONTROL */
    if (ina_vpack >= CHG_VPACK_OFF) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
    } else if (ina_vpack <= CHG_VPACK_ON) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_SET);
        charger_enabled = true;
    }
}

/* ============ UART Status Packets (split into two for ESP32 parsing)
 * ============ */

static void sendStatusPacket(void) {
    char buf[192];

    /* --- Packet 1: STATUS (system state, ADC-based diagnostics) --- */
    float vcap = readCapVoltage();
    float power_f = (float)weld_power_pct;
    snprintf(buf, sizeof(buf),
             "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
             "temp=%.2f,mode=%d,power=%.2f,vdda=%.3f,lead_r_ohm=%.6f",
             armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
             temp_filtered_c, (int)weld_mode, power_f, measured_vdda,
             lead_resistance_ohms);
    uartSend(buf);

    /* --- Packet 2: STATUS2 (INA226 telemetry) --- */
    snprintf(buf, sizeof(buf),
             "STATUS2,ina_ok=%d,chg_en=%d,vpack=%.2f,vlow=%.2f,"
             "vmid=%.2f,cell1=%.2f,cell2=%.2f,cell3=%.2f,ichg=%.2f",
             ina226_ok ? 1 : 0, charger_enabled ? 1 : 0, ina_vpack, vlow, vmid,
             ina_cell1, ina_cell2, ina_cell3, ina_ichg);
    uartSend(buf);
}

/* ============ Shunt Sensing Functions ============ */
static uint32_t adcReadFast(uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_6CYCLES_5;  // Speed for pulses
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) return 0xFFFF;
    HAL_ADC_Start(&hadc1);
    if (HAL_ADC_PollForConversion(&hadc1, 1) != HAL_OK) {
        HAL_ADC_Stop(&hadc1);
        return 0xFFFF;
    }
    uint32_t val = HAL_ADC_GetValue(&hadc1);
    HAL_ADC_Stop(&hadc1);
    return val;
}

static uint32_t adcReadFast2(uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_6CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    if (HAL_ADC_ConfigChannel(&hadc2, &sConfig) != HAL_OK) return 0xFFFF;
    HAL_ADC_Start(&hadc2);
    if (HAL_ADC_PollForConversion(&hadc2, 1) != HAL_OK) {
        HAL_ADC_Stop(&hadc2);
        return 0xFFFF;
    }
    uint32_t val = HAL_ADC_GetValue(&hadc2);
    HAL_ADC_Stop(&hadc2);
    return val;
}

static void capturePulseAmps(uint16_t ms) {
    uint32_t peak_raw = 0;
    float peak_current = 0.0f;
    float sum_current = 0.0f;
    uint32_t sample_count = 0;

    uint32_t start = HAL_GetTick();
    const float v_per_count = measured_vdda / 4095.0f;
    uint32_t next_sample_us =
        waveform_last_sample_us + WAVEFORM_SAMPLE_INTERVAL_US;

    while ((HAL_GetTick() - start) < ms) {
        uint32_t now_us = micros_now();
        if ((int32_t)(now_us - next_sample_us) < 0) {
            continue;
        }

        uint32_t p = adcReadFast(ADC_CHANNEL_2);
        uint32_t n = adcReadFast(ADC_CHANNEL_3);
        if (p == 0xFFFF || n == 0xFFFF) {
            continue;
        }

        int32_t diff = (int32_t)p - (int32_t)n;
        if (diff < 0) {
            diff = 0;
        }

        float v_adc = (float)diff * v_per_count;
        float v_shunt = v_adc / SHUNT_GAIN;
        float amps = (v_shunt / SHUNT_EFF_OHMS) * CURRENT_CAL_FACTOR;
        if (!isfinite(amps) || amps < 0.0f) amps = 0.0f;

        if ((uint32_t)diff > peak_raw) peak_raw = (uint32_t)diff;
        if (amps > peak_current) peak_current = amps;
        sum_current += amps;
        sample_count++;

        if (waveform_capture_active && waveform_index < WAVEFORM_BUFFER_SIZE) {
            waveform_buffer[waveform_index].current_amps = amps;
            waveform_buffer[waveform_index].voltage_volts = cached_vcap;
            waveform_buffer[waveform_index].timestamp_us =
                (uint32_t)(next_sample_us - waveform_capture_start_us);
            waveform_index++;
        }

        waveform_last_sample_us = next_sample_us;
        next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;

        while ((int32_t)(now_us - next_sample_us) >= 0) {
            next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;
        }
    }

    cal_adc_peak_raw = peak_raw;
    if (peak_current > current_peak_amps) current_peak_amps = peak_current;

    cal_current_avg =
        (sample_count > 0U) ? (sum_current / (float)sample_count) : 0.0f;
}

/* ============ Waveform Capture Helpers (Phase 3) ============ */
static uint32_t micros_now(void) {
    /* Use DWT cycle counter for microsecond timing. Fallback to ms tick if
     * unavailable. */
    if ((DWT->CTRL & DWT_CTRL_CYCCNTENA_Msk) != 0U && SystemCoreClock != 0U) {
        return (uint32_t)(DWT->CYCCNT / (SystemCoreClock / 1000000U));
    }
    return HAL_GetTick() * 1000U;
}

static void start_weld_pulse_capture(void) {
    waveform_index = 0;
    waveform_capture_start_us = micros_now();

    /* Manual anchor sample: force waveform to start at 0A before first real
     * captured sample (which may already be >0A due to fast pulse rise).
     * Use a FRESH capacitor-voltage read here for best accuracy; this runs
     * once before the pulse, so it has no impact on high-speed sampling.
     */
    waveform_buffer[0].current_amps = 0.0f;
    waveform_buffer[0].voltage_volts = readCapVoltage();
    waveform_buffer[0].timestamp_us = 0;
    waveform_index = 1;

    waveform_last_sample_us = waveform_capture_start_us;
    waveform_capture_active = true;
    uartSend("DBG,WAVEFORM_CAPTURE_START,seed=0A");
}

static void end_weld_pulse_capture(void) {
    waveform_capture_active = false;
    char dbg[64];
    snprintf(dbg, sizeof(dbg), "DBG,WAVEFORM_CAPTURE_STOP,count=%u",
             (unsigned int)waveform_index);
    uartSend(dbg);
}

