farmertan81/Spot-Welder/STM32G474CE/src/main.c
static void send_waveform_data(void) {
    if (waveform_index == 0) {
        uartSend("DBG,WAVEFORM_EMPTY");
        return;
    }

    char line[WAVEFORM_LINE_BUFFER_SIZE];
    int n = snprintf(line, sizeof(line), "WAVEFORM,%u",
                     (unsigned int)waveform_index);

    for (uint16_t i = 0; i < waveform_index; i++) {
        if (n <= 0 || n >= (int)sizeof(line)) break;
        n += snprintf(line + n, sizeof(line) - (size_t)n, ",%.2f,%.2f",
                      waveform_buffer[i].current_amps,
                      waveform_buffer[i].voltage_volts);
        if (n >= (int)sizeof(line)) break;
    }

    uartSend(line);

    char dbg[64];
    snprintf(dbg, sizeof(dbg), "DBG,WAVEFORM_TX,count=%u,format=WAVEFORM_CSV",
             (unsigned int)waveform_index);
    uartSend(dbg);
}

/* ============ Helpers ============ */
static void uartSend(const char* s) {
    HAL_UART_Transmit(&huart1, (uint8_t*)s, (uint16_t)strlen(s), 50);
    HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n", 2, 50);
}

static inline void pwmOff(void) {
    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, 0);
}

static inline void pwmOnDuty(uint16_t duty) {
    if (duty > PWM_MAX) duty = PWM_MAX;

    uint32_t ccr =
        ((uint32_t)duty * (uint32_t)(TIM1_ARR + 1U)) / (uint32_t)(PWM_MAX + 1U);
    if (ccr > TIM1_ARR) ccr = TIM1_ARR;

    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, ccr);
}

static bool contactDetectedRaw(float* out_vcap) {
    float vcap = readCapVoltage();
    if (out_vcap != NULL) {
        *out_vcap = vcap;
    }

    return (vcap > g_contact_threshold_v);
}

static bool contactDetected(void) {
    uint32_t now = HAL_GetTick();

    if ((now - g_contact_last_sample_ms) < CONTACT_SAMPLE_MS) {
        return g_contact_state;
    }
    g_contact_last_sample_ms = now;

    bool current_raw = contactDetectedRaw(&g_contact_last_vcap);

    if (!current_raw) {
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        return g_contact_state;
    }

    if (g_contact_state) {
        return true;
    }

    if (!g_contact_pending_high) {
        g_contact_pending_high = true;
        g_contact_pending_since_ms = now;
        return false;
    }

    if ((now - g_contact_pending_since_ms) >= CONTACT_DEBOUNCE_MS) {
        g_contact_state = true;
    }

    return g_contact_state;
}

static void clampParams(void) {
    if (weld_mode < 1) weld_mode = 1;
    if (weld_mode > 3) weld_mode = 3;

    if (weld_d1_ms > MAX_WELD_MS) weld_d1_ms = MAX_WELD_MS;
    if (weld_d2_ms > MAX_WELD_MS) weld_d2_ms = MAX_WELD_MS;
    if (weld_d3_ms > MAX_WELD_MS) weld_d3_ms = MAX_WELD_MS;

    if (weld_power_pct < 50) weld_power_pct = 50;
    if (weld_power_pct > 100) weld_power_pct = 100;

    if (preheat_pct > 100) preheat_pct = 100;
    if (preheat_ms > MAX_WELD_MS) preheat_ms = MAX_WELD_MS;

    if (trigger_mode < 1) trigger_mode = 1;
    if (trigger_mode > 2) trigger_mode = 2;

    if (contact_hold_steps < 1) contact_hold_steps = 1;
    if (contact_hold_steps > 10) contact_hold_steps = 10;
}

static void applyArmTimeout(void) {
    if (ARM_TIMEOUT_MS == 0) return;
    if (!armed) return;
    if (armed_until_ms == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - armed_until_ms) >= 0) {
        armed = false;
        armed_until_ms = 0;
        uartSend("EVENT,ARM_TIMEOUT");
    }
}

static void applyReadyTimeout(void) {
    if (!system_ready) return;
    if (READY_TIMEOUT_MS == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - ready_until_ms) >= 0) {
        system_ready = false;
        ready_until_ms = 0;
        uartSend("EVENT,READY_TIMEOUT");
    }
}

static uint16_t pctToDuty(uint8_t pct) {
    if (pct >= 100) return PWM_MAX;
    return (uint16_t)((uint32_t)pct * PWM_MAX / 100U);
}

static inline void delayMsExact(uint16_t ms) {
    if (ms == 0) return;
    if (ms > MAX_WELD_MS) ms = MAX_WELD_MS;

    uint32_t start = HAL_GetTick();
    while ((HAL_GetTick() - start) < ms) {
        __NOP();
    }
}

static void doPulseMsPwm(uint16_t ms, uint16_t duty) {
    if (ms == 0) return;
    if (ms > MAX_WELD_MS) ms = MAX_WELD_MS;

    /*
     * Timing optimization: cache cap voltage once before each pulse.
     * readCapVoltage() is intentionally NOT called in the fast 200us sampling
     * path.
     */
    cached_vcap = readCapVoltage();

    pwmOnDuty(duty);
    capturePulseAmps(ms);  // Measure while FET is on
    pwmOff();
}

static void fireRecipe(void) {
    uint32_t now_ms = HAL_GetTick();

    if (now_ms - boot_ms < BOOT_INHIBIT_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,BOOT_INHIBIT,ms=%lu",
                 (unsigned long)(BOOT_INHIBIT_MS - (now_ms - boot_ms)));
        uartSend(buf);
        return;
    }

    applyArmTimeout();
    applyReadyTimeout();

    if (!system_ready) {
        uartSend("DENY,NOT_READY");
        return;
    }

    if (!armed) {
        uartSend("DENY,NOT_ARMED");
        return;
    }

    if (temp_filtered_c > 65.0f) {
        uartSend("DENY,OVERHEAT");
        return;
    }

    {
        bool need_contact = true;
        if (trigger_mode == 1 && contact_with_pedal == 0) {
            need_contact = false;  // pedal mode with contact check disabled
        }
        if (need_contact && !contactDetected()) {
            uartSend("DENY,NO_CONTACT");
            return;
        }
    }

    if (welding_now) {
        uartSend("DENY,ALREADY_WELDING");
        return;
    }

    uint32_t since = now_ms - last_weld_ms;
    if (since < WELD_COOLDOWN_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,COOLDOWN,ms=%lu",
                 (unsigned long)(WELD_COOLDOWN_MS - since));
        uartSend(buf);
        return;
    }

    clampParams();

    /* === WELD SEQUENCE (modified per refactor plan) === */

    /* Step 1: Disable charger */
    HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
    charger_enabled = false;

    /* Step 2: Wait 50ms for charger to settle */
    HAL_Delay(50);

