farmertan81/Spot-Welder/STM32G474CE/src/main.c
    welding_now = true;
    current_peak_amps = 0.0f;
    /* Step 3: ADC diagnostic snapshot BEFORE weld (diagnostic only) */
    cal_vcap_before = readCapVoltage();

    /* Start waveform capture after pre-weld settling, right before pulse train.
     */
    start_weld_pulse_capture();

    uartSend("EVENT,WELD_START");

    pwmOff();
    HAL_Delay(2);

    uint32_t t0 = HAL_GetTick();

    /* === Execute weld pulse (HRTIM/PWM code UNTOUCHED) === */
    if (preheat_enabled && preheat_ms > 0) {
        doPulseMsPwm(preheat_ms, pctToDuty(preheat_pct));
        if (preheat_gap_ms > 0) {
            pwmOff();
            delayMsExact(preheat_gap_ms);
        }
    }

    uint16_t mainDuty = pctToDuty(weld_power_pct);

    if (weld_mode >= 1) {
        doPulseMsPwm(weld_d1_ms, mainDuty);
    }
    if (weld_mode >= 2) {
        if (weld_gap1_ms) delayMsExact(weld_gap1_ms);
        doPulseMsPwm(weld_d2_ms, mainDuty);
    }
    if (weld_mode >= 3) {
        if (weld_gap2_ms) delayMsExact(weld_gap2_ms);
        doPulseMsPwm(weld_d3_ms, mainDuty);
    }

    uint32_t total_ms = HAL_GetTick() - t0;

    pwmOff();

    /* Phase 3: stop waveform capture immediately when pulse sequence ends. */
    end_weld_pulse_capture();

    welding_now = false;
    last_weld_ms = HAL_GetTick();

    /* 🔴 Engage post-weld lockout (MOVED HERE) */
    charger_lockout = true;
    charger_lockout_until = HAL_GetTick() + 500;

    /* Step 5: Wait 50ms post-weld */
    HAL_Delay(50);

    /* Step 6: ADC diagnostic snapshot AFTER weld (diagnostic only) */
    cal_vcap_after = readCapVoltage();

    float delta_v = cal_vcap_before - cal_vcap_after;
    float time_s = total_ms / 1000.0f;

    /* Voltage drop across leads at average current */
    float v_drop_leads = cal_current_avg * lead_resistance_ohms;

    /* Voltage actually delivered at the weld tips */
    float v_at_tips = cal_vcap_before - v_drop_leads;
    if (v_at_tips < 0.0f) v_at_tips = 0.0f;

    /* True energy delivered to weld spot (not cap bank energy) */
    float energy_joules = v_at_tips * cal_current_avg * time_s;

    char buf[256];
    snprintf(buf, sizeof(buf),
             "EVENT,WELD_DONE,total_ms=%lu,mode=%d,d1=%d,gap1=%d,d2=%d,gap2=%d,"
             "d3=%d,power_pct=%d,preheat_en=%d,preheat_ms=%d,"
             "peak_a=%.1f,adc_raw=%lu,vcap_b=%.3f,vcap_a=%.3f,delta_v=%.3f,"
             "avg_a=%.1f,v_tips=%.3f,energy_j=%.2f",
             (unsigned long)total_ms, weld_mode, weld_d1_ms, weld_gap1_ms,
             weld_d2_ms, weld_gap2_ms, weld_d3_ms, weld_power_pct,
             preheat_enabled ? 1 : 0, preheat_ms, current_peak_amps,
             (unsigned long)cal_adc_peak_raw, cal_vcap_before, cal_vcap_after,
             delta_v, cal_current_avg, v_at_tips, energy_joules);
    uartSend(buf);

    /* Phase 3: transmit waveform CSV burst right after weld completion event.
     */
    send_waveform_data();
}

static void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;

    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV4;
    RCC_OscInitStruct.PLL.PLLN = 85;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
    RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        while (1) {
        }
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK) {
        while (1) {
        }
    }
}

static void MX_GPIO_Init(void) {
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    GPIO_InitStruct.Pin = LED_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = PEDAL_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(PEDAL_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_8;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF6_TIM1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin =
        GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Legacy PA6 input kept configured as a hardware fallback only.
     * Runtime contact detection now uses AMC1311B vcap thresholding. */
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* NEW: PB2 = CHARGER_EN output, default LOW (charger disabled) */
    GPIO_InitStruct.Pin = CHARGER_EN_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(CHARGER_EN_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);

    /* I2C1 pins: PA15 = SCL, PB7 = SDA (configured in MX_I2C1_Init)
     * Changed from PB8/PB9 which interfered with DFU boot.
     * PA14 (SWCLK) avoided – SWD pull-down conflicts with I2C SDA. */
}

