farmertan81/Spot-Welder/STM32G474CE/src/main.c
    return vdda;
}

/**
 * @brief I2C bus recovery – unstick hung I2C devices.
 * Toggles SCL 9 times with SDA released to complete any partial transaction.
 * Must be called BEFORE MX_I2C1_Init() to clear stuck bus conditions.
 *
 * Pins: PA15 = I2C1_SCL, PB7 = I2C1_SDA
 */
static void i2c_bus_recovery(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Configure PA15 (SCL) as open-drain output */
    GPIO_InitStruct.Pin = GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Configure PB7 (SDA) as open-drain output */
    GPIO_InitStruct.Pin = GPIO_PIN_7;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* Release SDA high */
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_SET);

    /* Toggle SCL 9 times to unstick any hung device */
    for (int i = 0; i < 9; i++) {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_RESET); /* SCL low  */
        HAL_Delay(1);
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET); /* SCL high */
        HAL_Delay(1);
    }

    /* Generate STOP condition: SDA low → SCL high → SDA high */
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_RESET); /* SDA low  */
    HAL_Delay(1);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET); /* SCL high */
    HAL_Delay(1);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_SET); /* SDA high */
    HAL_Delay(1);

    /* Reconfigure PA15 as I2C1_SCL alternate function (AF4) */
    GPIO_InitStruct.Pin = GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Reconfigure PB7 as I2C1_SDA alternate function (AF4) */
    GPIO_InitStruct.Pin = GPIO_PIN_7;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

/**
 * @brief I2C1 initialization for INA226 sensors – graceful error handling.
 *
 * Pins: PA15 = I2C1_SCL (AF4), PB7 = I2C1_SDA (AF4)
 * Changed from PB8/PB9 (DFU boot conflict) and PA14 (SWCLK conflict).
 * On failure, sets ina226_ok = false and returns – does NOT hang.
 */
static void MX_I2C1_Init(void) {
    __HAL_RCC_I2C1_CLK_ENABLE();

    /* Configure PA15 = I2C1_SCL */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Configure PB7 = I2C1_SDA */
    GPIO_InitStruct.Pin = GPIO_PIN_7;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    hi2c1.Instance = I2C1;
    hi2c1.Init.Timing = 0x10909CEC; /* 100kHz @ 170MHz PCLK1 (validated) */
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

    if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
        /* Graceful failure – set flag and return, do NOT hang */
        ina226_ok = false;
        return;
    }

    /* Configure analog filter */
    if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) !=
        HAL_OK) {
        ina226_ok = false;
        return;
    }

    /* Configure digital filter */
    if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK) {
        ina226_ok = false;
        return;
    }
}

static uint32_t adcReadChannel(uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_247CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;

    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        return 0xFFFF;
    }

    HAL_ADC_Start(&hadc1);
    if (HAL_ADC_PollForConversion(&hadc1, 10) != HAL_OK) {
        HAL_ADC_Stop(&hadc1);
        return 0xFFFF;
    }

    uint32_t val = HAL_ADC_GetValue(&hadc1);
    HAL_ADC_Stop(&hadc1);
    return val;
}

static float readThermistor(void) {
    uint32_t raw = adcReadChannel(ADC_CHANNEL_1);
    if (raw == 0xFFFF || raw < 10 || raw > 4085) return -99.0f;

    float vdda =
        measured_vdda; /* Use calibrated VDDA instead of hardcoded 3.3V */
    float v = (float)raw * (vdda / 4095.0f);
    if (v <= 0.01f || v >= (vdda - 0.01f)) return -99.0f;

    float r_ntc = THERM_SERIES_R * ((vdda / v) - 1.0f);
    if (r_ntc <= 0.0f) return -99.0f;

    float s = logf(r_ntc / THERM_NOMINAL_R) / THERM_BETA;
    s += 1.0f / (THERM_NOMINAL_T + 273.15f);
    return (1.0f / s) - 273.15f + THERM_OFFSET_C;
}

/**
 * @brief Read capacitor bank voltage via AMC1311B isolated amplifier.
 *
 * AMC1311B OUTP (Pin 7) → PA3 → ADC1_IN4  (VOLT_AIN0)
 * AMC1311B OUTN (Pin 6) → PA4 → ADC2_IN17 (VOLT_AIN1)
 *
 * BUG FIX: PA4 is ADC2_IN17, NOT ADC1_IN5. The old code used
 * adcReadChannel(ADC_CHANNEL_5) which reads PB14 on ADC1, not PA4.
 * Now uses adcReadChannel2(ADC_CHANNEL_17) to correctly read PA4 via ADC2.
 *
 * VDDA calibration: Uses measured_vdda from VREFINT instead of hardcoded 3.3V.
 *
 * Verification notes:
 * - With VIN ≈ 0V: expect OUTP ≈ OUTN ≈ 1.44V, so vP - vN ≈ 0V
 * - At steady state: vcap should match INA226 vpack reading
 */
static float readCapVoltage(void) {
    uint32_t sumP = 0, sumN = 0;
    const int samples = 16;

    for (int i = 0; i < samples; i++) {
        uint32_t p = adcReadChannel(ADC_CHANNEL_4);    // PA3
        uint32_t n = adcReadChannel2(ADC_CHANNEL_17);  // PA4

        if (p == 0xFFFF || n == 0xFFFF) return 0.0f;

        sumP += p;
        sumN += n;
    }

