farmertan81/Spot-Welder/STM32G474CE/src/main.c
    float vdda = measured_vdda;

    float vP = ((float)sumP / samples) * (vdda / 4095.0f);
    float vN = ((float)sumN / samples) * (vdda / 4095.0f);

    float v = (vP - vN) * V_CAP_DIVIDER;

    /* Clamp negative noise to zero (AMC1311B outputs ~0 differential at idle
     * with no return path – this is correct hardware behavior, not a bug).
     * Upper clamp removed: allow readings above 9.5V for accurate delta_v
     * capture during high-charge welds. */
    if (v < 0.0f) v = 0.0f;

    return v;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart) {
    if (huart->Instance == USART1) {
        char c = (char)rx_byte;
        uart_rx_bytes++;

        if (c == '\n' || c == '\r') {
            if (rx_idx > 0) {
                rx_build[rx_idx] = '\0';
                if (!rx_line_ready) {
                    memcpy(rx_ready, rx_build, rx_idx + 1);
                    rx_line_ready = true;
                }
                rx_idx = 0;
            }
        } else if (rx_idx < RX_LINE_MAX - 1) {
            rx_build[rx_idx++] = c;
        } else {
            rx_idx = 0;
        }

        HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
    }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef* huart) {
    if (huart->Instance == USART1) {
        uint32_t err = huart->ErrorCode;
        uart_rx_errors++;

        if (err & HAL_UART_ERROR_ORE) uart_rx_overruns++;

        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_FEF);
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_NEF);
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF);
        huart->ErrorCode = HAL_UART_ERROR_NONE;

        HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
    }
}

static void parseCommand(char* line) {
    char response[256];

    {
        char* p = line;
        while (*p == ' ' || *p == '\t') p++;
        if (*p == '\0') return;
    }

    if (strncmp(line, "READY,", 6) == 0) {
        int v = atoi(line + 6);
        if (v == 1) {
            system_ready = true;
            ready_until_ms = HAL_GetTick() + READY_TIMEOUT_MS;
            uartSend("ACK,READY,1");
        } else {
            system_ready = false;
            ready_until_ms = 0;
            uartSend("ACK,READY,0");
        }
        return;
    }

    if (strncmp(line, "ARM,", 4) == 0) {
        int v = atoi(line + 4);
        if (v == 1) {
            armed = true;
            armed_until_ms =
                (ARM_TIMEOUT_MS == 0) ? 0 : (HAL_GetTick() + ARM_TIMEOUT_MS);
            uartSend("ACK,ARM,1");
        } else {
            armed = false;
            armed_until_ms = 0;
            uartSend("ACK,ARM,0");
        }
        return;
    }

    if (strncmp(line, "CMD,SET,PULSE,", 14) == 0) {
        int val = atoi(line + 14);
        if (val > 0 && val <= MAX_WELD_MS) {
            weld_d1_ms = (uint16_t)val;
            snprintf(response, sizeof(response), "ACK,PULSE=%d", weld_d1_ms);
            uartSend(response);
        } else {
            uartSend("ERR,PULSE_RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_PULSE,", 10) == 0) {
        int v_mode = 1, v_d1 = 0, v_gap1 = 0, v_d2 = 0, v_gap2 = 0, v_d3 = 0;
        int n = sscanf(line, "SET_PULSE,%d,%d,%d,%d,%d,%d", &v_mode, &v_d1,
                       &v_gap1, &v_d2, &v_gap2, &v_d3);
        if (n >= 2) {
            weld_mode = (uint8_t)v_mode;
            weld_d1_ms = (uint16_t)v_d1;
            weld_gap1_ms = (uint16_t)v_gap1;
            weld_d2_ms = (uint16_t)v_d2;
            weld_gap2_ms = (uint16_t)v_gap2;
            weld_d3_ms = (uint16_t)v_d3;
            clampParams();
            snprintf(response, sizeof(response), "ACK,SET_PULSE,mode=%d",
                     weld_mode);
            uartSend(response);
        } else {
            uartSend("DENY,BAD_SET_PULSE");
        }
        return;
    }

    if (strncmp(line, "CMD,SET,POWER,", 14) == 0) {
        int val = atoi(line + 14);
        if (val >= 50 && val <= 100) {
            weld_power_pct = (uint8_t)val;
            snprintf(response, sizeof(response), "ACK,POWER=%d",
                     weld_power_pct);
            uartSend(response);
        } else {
            uartSend("ERR,POWER_RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_POWER,", 10) == 0) {
        weld_power_pct = (uint8_t)atoi(line + 10);
        clampParams();
        snprintf(response, sizeof(response), "ACK,SET_POWER,pct=%d",
                 weld_power_pct);
        uartSend(response);
        return;
    }

    if (strncmp(line, "SET_PREHEAT,", 12) == 0) {
        int v_en = 0, v_ms = 0, v_pct = 0, v_gap = 0;
        int n = sscanf(line, "SET_PREHEAT,%d,%d,%d,%d", &v_en, &v_ms, &v_pct,
                       &v_gap);
        if (n >= 3) {
            preheat_enabled = (v_en == 1);
            preheat_ms = (uint16_t)v_ms;
            preheat_pct = (uint8_t)v_pct;
            if (n >= 4) preheat_gap_ms = (uint16_t)v_gap;
            clampParams();
            snprintf(response, sizeof(response), "ACK,SET_PREHEAT,en=%d",
                     preheat_enabled ? 1 : 0);
            uartSend(response);
        } else {
            uartSend("DENY,BAD_SET_PREHEAT");
        }
        return;
    }

    if (strncmp(line, "SET_TRIGGER_MODE,", 17) == 0) {
        int v = atoi(line + 17);
        if (v < 1) v = 1;
        if (v > 2) v = 2;
        trigger_mode = (uint8_t)v;

        snprintf(response, sizeof(response), "ACK,SET_TRIGGER_MODE,mode=%d",
                 trigger_mode);
        uartSend(response);
        return;
    }

    const char* cwp_prefix = "SET_CONTACT_WITH_PEDAL,";
    if (strncmp(line, cwp_prefix, strlen(cwp_prefix)) == 0) {
        int v = atoi(line + strlen(cwp_prefix));
        contact_with_pedal = (v == 0) ? 0 : 1;
        snprintf(response, sizeof(response), "ACK,SET_CONTACT_WITH_PEDAL,%d",
                 contact_with_pedal);
        uartSend(response);
        return;
    }

    if (strncmp(line, "CONTACT_THRESH=", 15) == 0) {
        float v = strtof(line + 15, NULL);
        if (v < 0.1f) v = 0.1f;
        if (v > 9.0f) v = 9.0f;
        g_contact_threshold_v = v;
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        snprintf(response, sizeof(response), "OK,CONTACT_THRESH=%.2f",
                 g_contact_threshold_v);
        uartSend(response);
        return;
    }

